hm3.tex
% Created 2026-04-09 Thu 17:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=0.75in,right=0.75in,top=1in,bottom=1in]{geometry}
\usepackage{enumitem}
\setlist[itemize]{itemsep=2pt, topsep=4pt}
\author{Ben Heinze}
\date{\today}
\title{CSCI 532 - Algorithms Homework 3}
\hypersetup{
 pdfauthor={Ben Heinze},
 pdftitle={CSCI 532 - Algorithms Homework 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents




\section{Problem 1.}
\label{sec:org0cdef60}


The maximum-weight matching problem on a bipartite graph is as follows:
Given a bipartite graph with edge weights, select the subset of edges with the largest total
weight such that no edges share a node. Formulate this problem as an ILP.


\section{Solution 1}
\label{sec:orgfb7b118}

\(x_i \in \{0,1\} =\) indicates if vertex \(i\) is selected

Objecive:
max()


Constraints:
\begin{itemize}
\item 

\item 

\item 
\end{itemize}



\section{Problem 2.}
\label{sec:orgf123476}

If you remove the integer restriction on variables in the ILP from the previous
problem, will the resulting LP still find valid optimal solutions to the maximum-weight matching problem on bipartite graphs? Why or why not?
\end{document}
